Saipreetham0/ESP32-stabakaiot/src/main.cpp
#include <Arduino.h>
#include <Wire.h>
#include <Adafruit_Sensor.h>
#include <Adafruit_BME280.h>
#include <Firebase_ESP_Client.h>
#include <addons/TokenHelper.h>
#include <BH1750.h>
#include <SimpleTimer.h>
#include "time.h"
#include "MHZ19.h"
#include <HTTPClient.h>
#include <Update.h>
#include <ESP32Encoder.h>
#include <ItemToggle.h>
#include <ItemSubMenu.h>
#include <ItemCommand.h>
#include <ItemInput.h>
#include <LcdMenu.h>
#include <OneButton.h>
#include <EEPROM.h>

// Provide the token generation process info.
#include "addons/TokenHelper.h"
// Provide the RTDB payload printing info and other helper functions.
#include "addons/RTDBHelper.h"

// Firmware path and OTA
#define FIRMWARE_PATH "production/firmware.bin"
// #define FIRMWARE_PATH "test/firmware.bin"
const char *firmwareVersion = "1.0.4";

// Firebase Data Path

// String DeviceDocumentPath = "device1/";
// String DeviceDocumentPath = "device12/";

// Global variables
// TEMP SET POINTS
int tempSetPointOff;
int tempSetPointOn;

// HUM SET POINTS
int humdSetPointOff;
int humdSetPointOn;

// DEHUM SET POINTS
int dehumdSetPointOff;
int dehumdSetPointOn;

// gobal char Converter to the text

char tempOnValue[20];
char tempOffValue[20];
char dehumOnValue[20];
char dehumOffValue[20];
char humdOnValue[20];
char humdOffValue[20];

SimpleTimer timer;

const uint32_t connectTimeoutMs = 10000;

// Define EEPROM addresses for storing set point values
#define EEPROM_TEMP_SET_POINT_ON_ADDR 0
#define EEPROM_TEMP_SET_POINT_OFF_ADDR (EEPROM_TEMP_SET_POINT_ON_ADDR + sizeof(int))
#define EEPROM_HUMD_SET_POINT_ON_ADDR (EEPROM_TEMP_SET_POINT_OFF_ADDR + sizeof(int))
#define EEPROM_HUMD_SET_POINT_OFF_ADDR (EEPROM_HUMD_SET_POINT_ON_ADDR + sizeof(int))
#define EEPROM_DEHUMD_SET_POINT_ON_ADDR (EEPROM_HUMD_SET_POINT_OFF_ADDR + sizeof(int))
#define EEPROM_DEHUMD_SET_POINT_OFF_ADDR (EEPROM_DEHUMD_SET_POINT_ON_ADDR + sizeof(int))

int readTempSetPointOn;
int readTempSetPointOff;
int readHumdSetPointOn;
int readHumdSetPointOff;
int readDehumdSetPointOn;
int readDehumdSetPointOff;

// Commit changes

struct tm timeinfo;
char timestamp[20];

unsigned long previousMillis = 0; // Variable to store the last time the timestamp was updated
const long interval = 1000;       // Interval in milliseconds to update the timestamp

// unsigned long previousMillis1 = 0;
// unsigned long interval1 = 30000;

// LCD Menu //
#define LCD_ROWS 4
#define LCD_COLS 20

// Encoder Pins
#define ROTARY_ENCODER_CLK 16 // Replace with your CLK pin 4
#define ROTARY_ENCODER_DT 5   // Replace with your DT pin
#define ROTARY_ENCODER_SW 17  // Replace with your SW (button) pin 19

// PUSH BUTTONS DEFINE

const int buttonMenuPin = 18; // Button for entering the menu
const int buttonOkPin = 15;   // Button for confirming a menu selection

// ENCODER DEFINE
ESP32Encoder encoder;

// ONEBUTTON AND ENCODER DEFINE
OneButton button(ROTARY_ENCODER_SW, true);

// DOUBLE CLICK AND SINGLE CLICK
unsigned long lastButtonClickTime = 0;
const unsigned long doubleClickTimeThreshold = 500; // milliseconds

// SET POINTS VALUE
#define CHARSET_SIZE 10
// Create your charset
char charset[] = {
    '0',
    '1',
    '2',
    '3',
    '4',
    '5',
    '6',
    '7',
    '8',
    '9',
};

LcdMenu menu(LCD_ROWS, LCD_COLS);
void inputCallback(char *value);
void toggleBacklight(uint16_t isOn);
uint8_t charsetPosition;
void hideMenu();

void ConnectToWifi();

volatile bool dataChanged = false;

volatile bool sensorsData = true;

volatile bool DeviceStatus = false;

void handleButtonClick()
{
  // menu.enter(); // Perform "Enter" action on button push
  unsigned long currentTime = millis();
  if (currentTime - lastButtonClickTime <= doubleClickTimeThreshold)
  {
    // Perform "Double-Click" action
    menu.back(); // Go back in the menu
    delay(200);
  }
  else
  {
    // Perform "Single-Click" action//

    menu.type(charset[charsetPosition]);

    menu.enter(); // Enter the selected menu item
    delay(200);
  }

  lastButtonClickTime = currentTime;
}

void inputTempSetPointONCallback(char *value);
void inputTempSetPointOFFCallback(char *value);

void inputDehubSetPointONCallback(char *value);
void inputDehubSetPointOFFCallback(char *value);

void inputHumSetPointONCallback(char *value);
void inputHumSetPointOFFCallback(char *value);

extern MenuItem *tempMenu[];
extern MenuItem *dehumMenu[];
extern MenuItem *humMenu[];

MAIN_MENU(
    // ITEM_INPUT("Temp SP_ON", inputTempSetPointONCallback),
    ITEM_SUBMENU("Temperature", tempMenu),
    ITEM_SUBMENU("Dehumidity", dehumMenu),
    ITEM_SUBMENU("Humidity", humMenu),
    ITEM_COMMAND("Hide Menu", hideMenu),
    ITEM_COMMAND("Connect to WiFi", hideMenu),
    ITEM_TOGGLE("Backlight", toggleBacklight),
    ITEM_BASIC("Connect to WiFi"),
    ITEM_BASIC("About"));

SUB_MENU(tempMenu, mainMenu,
         ITEM_INPUT("Temp SP_ON", inputTempSetPointONCallback),
         ITEM_INPUT("Temp SP_OFF", inputTempSetPointOFFCallback));

SUB_MENU(dehumMenu, mainMenu,
         ITEM_INPUT("Dehum SP_ON", inputDehubSetPointONCallback),
         ITEM_INPUT("Dehum SP_OFF", inputDehubSetPointOFFCallback));

SUB_MENU(humMenu, mainMenu,
         ITEM_INPUT("Humi SP_ON", inputHumSetPointONCallback),
         ITEM_INPUT("Humi SP_OFF", inputHumSetPointOFFCallback));
// LCD MENU

// Declare sensor variables
Adafruit_BME280 bme;
MHZ19 myMHZ19;
HardwareSerial mySerial(0); // On ESP32, we use HardwareSerial

LiquidCrystal_I2C lcd(0x27, 20, 4);

BH1750 lightMeter;

bool taskCompleted = false;
// unsigned long timestamp;
FirebaseJson json;

int temperature;
int humidity;
int CO2;
int lux;

// WiFi and Firebase credentials
// #define WIFI_SSID "KSP"
// #define WIFI_PASSWORD "9550421866"
#define WIFI_SSID "StabakaBiosciences"
#define WIFI_PASSWORD "Stabaka24"
// #define WIFI_SSID "STABAKAIOT"
// #define WIFI_PASSWORD "STABAKAIOT@1234"

#define API_KEY "AIzaSyCiIG-sTPSX06NeqO1oKY45g6z1xxT56Lw"
#define FIREBASE_PROJECT_ID "ksp-iot"
#define USER_EMAIL "device1@stabaka.com"
#define USER_PASSWORD "MzfCtLPz!nJm7fPY"
#define DATABASE_URL "ksp-iot-default-rtdb.asia-southeast1.firebasedatabase.app"
#define STORAGE_BUCKET_ID "ksp-iot.appspot.com"

FirebaseData fbdo;
FirebaseData stream;
FirebaseAuth auth;
FirebaseConfig configF;

