Saipreetham0/ESP32-stabakaiot/src/main.cpp
// Variables to save database paths
String listenerPath = "board1/outputs/digital/";

String parentPath;

// WIFI Reconnect Method
#define MAX_WIFI_RECONNECT_ATTEMPTS 5
#define WIFI_CONNECT_TIMEOUT 30 // seconds

// Declare outputs
const int Relay1 = 14; // mm
const int Relay2 = 27; // mm
const int Relay3 = 26; // mm
const int Relay4 = 25;
const int Relay5 = 13;
const int Relay6 = 4;
const int Relay7 = 23;
const int Relay8 = 19;

void fcsDownloadCallback(FCS_DownloadStatusInfo info)
{
  if (info.status == fb_esp_fcs_download_status_init)
  {
    Serial.printf("New update found\n");
    Serial.printf("Downloading firmware %s (%d bytes)\n", info.remoteFileName.c_str(), info.fileSize);
    menu.hide();
    menu.lcd->clear();
    menu.lcd->setCursor(0, 0);
    menu.lcd->print("New update found");
  }
  else if (info.status == fb_esp_fcs_download_status_download)
  {
    Serial.printf("Downloaded %d%s\n", (int)info.progress, "%");
    menu.lcd->setCursor(0, 1);
    menu.lcd->print("Downloading " + String((int)info.progress) + " %");
  }
  else if (info.status == fb_esp_fcs_download_status_complete)
  {
    Serial.println("Donwload firmware completed.");
    Serial.println();
    menu.lcd->setCursor(0, 2);
    menu.lcd->print("Donwload firmware completed.");
  }
  else if (info.status == fb_esp_fcs_download_status_error)
  {
    // Serial.printf("New firmware update not available or download failed, %s\n", info.errorMsg.c_str());
    // menu.lcd->setCursor(0, 3);
    // menu.lcd->print("Error:" + String(info.errorMsg.c_str()));
  }
}

void streamCallback(FirebaseStream data)
{
  Serial.printf("stream path, %s\nevent path, %s\ndata type, %s\nevent type, %s\n\n",
                data.streamPath().c_str(),
                data.dataPath().c_str(),
                data.dataType().c_str(),
                data.eventType().c_str());
  printResult(data); // see addons/RTDBHelper.h
  Serial.println();

  // Get the path that triggered the function
  String streamPath = String(data.dataPath());
  Serial.print(streamPath);

  // Handle paths for temperature and humidity set points
  if (streamPath.endsWith("/temp_set_point_off"))
  {
    // tempSetPointOff = data.intData();
    Serial.print("Temp Set Point Off: ");
    Serial.println(tempSetPointOff);
  }
  else if (streamPath.endsWith("/humd_set_point_off"))
  {
    // humdSetPointOff = data.intData();
    Serial.print("Humd Set Point Off: ");
    Serial.println(humdSetPointOff);
  }
  else if (streamPath.endsWith("/humd_set_point_on"))
  {
    // humdSetPointOn = data.intData();
    Serial.print("Humd Set Point On: ");
    Serial.println(humdSetPointOn);
  }
  else if (streamPath.endsWith("/temp_set_point_on"))
  {
    // tempSetPointOn = data.intData();
    Serial.print("Temp Set Point On: ");
    Serial.println(tempSetPointOn);
  }
  else if (streamPath.endsWith("/dehumd_set_point_off"))
  {
    // dehumdSetPointOff = data.intData();
    Serial.print("deHumd Set Point Off: ");
    Serial.println(dehumdSetPointOff);
  }
  else if (streamPath.endsWith("/dehumd_set_point_on"))
  {
    // dehumdSetPointOn = data.intData();
    Serial.print("deHumd Set Point On: ");
    Serial.println(dehumdSetPointOn);
  }

  // Handle GPIO changes
  // if the data returned is an integer, there was a change on the GPIO state on the following path /{gpio_number}
  if (data.dataTypeEnum() == fb_esp_rtdb_data_type_integer)
  {
    String gpio = streamPath.substring(1);
    int state = data.intData();
    Serial.print("GPIO: ");
    Serial.println(gpio);
    Serial.print("STATE: ");
    Serial.println(state);
    digitalWrite(gpio.toInt(), state);
  }

  // Handle JSON changes
  if (data.dataTypeEnum() == fb_esp_rtdb_data_type_json)
  {
    FirebaseJson json = data.to<FirebaseJson>();
    size_t count = json.iteratorBegin();
    Serial.println("\n---------");
    for (size_t i = 0; i < count; i++)
    {
      FirebaseJson::IteratorValue value = json.valueAt(i);
      int gpio = value.key.toInt();
      int state = value.value.toInt();
      Serial.print("STATE: ");
      Serial.println(state);
      Serial.print("GPIO:");
      Serial.println(gpio);
      digitalWrite(gpio, state);
      Serial.printf("Name: %s, Value: %s, Type: %s\n", value.key.c_str(), value.value.c_str(), value.type == FirebaseJson::JSON_OBJECT ? "object" : "array");
    }
    Serial.println();
    json.iteratorEnd();
  }

  delay(5000); // Add delay after JSON changes block
  Serial.printf("Received stream payload size: %d (Max. %d)\n\n", data.payloadLength(), data.maxPayloadLength());

  dataChanged = true;
}

void streamTimeoutCallback(bool timeout)
{
  if (timeout)
    Serial.println("stream timeout, resuming...\n");
  if (!stream.httpConnected())
    Serial.printf("error code: %d, reason: %s\n\n", stream.httpCode(), stream.errorReason().c_str());
}

void initWiFi()
{
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(1000);
    Serial.println("Connecting to WiFi...");
    menu.lcd->clear();
    menu.lcd->setCursor(0, 0);
    menu.lcd->print("Connecting to WiFi...");
  }
  Serial.print("Connected to");
  Serial.println(WIFI_SSID);
  menu.lcd->clear();
  menu.lcd->setCursor(0, 0);
  menu.lcd->print("Connected to ");
  menu.lcd->setCursor(0, 1);
  menu.lcd->println(WIFI_SSID);
  DeviceStatus = false;

  delay(3000);
}

void displaySensorValues()
{

  menu.lcd->clear();
  menu.lcd->setCursor(0, 0);
  menu.lcd->print("T: ");
  menu.lcd->print(temperature);
  menu.lcd->print(" C");

  menu.lcd->setCursor(10, 0);
  menu.lcd->print("H: ");
  menu.lcd->print(humidity);
  menu.lcd->print(" %");

  menu.lcd->setCursor(0, 1);
  menu.lcd->print("CO2: ");
  menu.lcd->print(CO2);
  menu.lcd->print(" ppm");

  menu.lcd->setCursor(0, 2);
  menu.lcd->print("Lux: ");
  menu.lcd->print(lux);
  menu.lcd->print(" lux");

  strftime(timestamp, sizeof(timestamp), "%H:%M", &timeinfo);

  menu.lcd->setCursor(0, 3);
  menu.lcd->print("Time: ");
  menu.lcd->print(timestamp);

  if (DeviceStatus)
  {
    menu.lcd->setCursor(13, 3);
    menu.lcd->print("offline");
  }

