Saipreetham0/ESP32-stabakaiot/src/main.cpp
  delay(3000);
}

void uploadData()
{
  taskCompleted = false;
}

// String parentPath;
void getRealTimeSensorsData()
{
  delay(3000);
  temperature = bme.readTemperature();
  humidity = bme.readHumidity();
  CO2 = myMHZ19.getCO2();
  lux = lightMeter.readLightLevel();
}
void SensorDataUpload()
{

  if (WiFi.status() == WL_CONNECTED)
  {

    if (Firebase.ready())
    {
      Serial.print("Getting Sensor Data");

      // Fetch sensor data
      // sensors.requestTemperatures();
      temperature = bme.readTemperature();
      humidity = bme.readHumidity();
      CO2 = myMHZ19.getCO2();
      lux = lightMeter.readLightLevel();
      // displaySensorValues();

      Serial.print("Humidity: ");
      Serial.print(humidity);

      Serial.println("%");

      Serial.print("CO2: ");
      Serial.println(CO2);

      Serial.print("Lux: ");
      Serial.println(lux);

      FirebaseJson content;
      // timestamp = getTime();

      // struct tm timeinfo;
      // if (!getLocalTime(&timeinfo))
      // {
      //   Serial.println("Failed to obtain time");
      //   return;
      // }

      // Print timestamp
      // char timestamp[20];
      strftime(timestamp, sizeof(timestamp), "%Y-%m-%d-%H-%M", &timeinfo);
      Serial.print("Timestamp: ");
      Serial.println(timestamp);

      char timestamp1[20];
      strftime(timestamp1, sizeof(timestamp1), "%Y-%m-%d %H:%M", &timeinfo);
      Serial.print("Timestamp: ");
      Serial.println(timestamp1);
      // String formattedTimestamp = Firebase.timestamp(timestamp);

      String documentPath = "device1/" + String(timestamp);

      content.set("fields/temp/doubleValue", temperature);
      content.set("fields/humidity/doubleValue", humidity);
      content.set("fields/CO2/integerValue", CO2);
      content.set("fields/lux/doubleValue", lux);
      content.set("fields/myTimestamp/stringValue", String(timestamp1)); // RFC3339 UTC "Zulu" format

      Serial.print("Create a document... ");
      if (Firebase.Firestore.createDocument(&fbdo, FIREBASE_PROJECT_ID, "", documentPath.c_str(), content.raw()))
        Serial.printf("ok\n%s\n\n", fbdo.payload().c_str());
      else
        Serial.println(fbdo.errorReason());
    }
  }
  else
  {
    Serial.println("Firebase Upload Offline");
  }
}

void keepWiFiAlive(void *parameter)
{

  Serial.println("WiFI Task");

  unsigned long previousMillis1 = 0;
  const long interval1 = 5000; // Interval for reconnection attempt (5 seconds)

  for (;;)
  {
    if (WiFi.status() == WL_CONNECTED)
    {
      Serial.println("WiFI still connected.");
      vTaskDelay(10000 / portTICK_PERIOD_MS);
      continue;
    }

    // Serial.println("WiFi Connecting");
    // WiFi.mode(WIFI_STA);
    // WiFi.begin(WIFI_NETWORK, WIFI_PASSWORD);

    // unsigned long startAttemptTime = millis();

    // // Keep looping while we're not connected and haven't reached the timeout
    // while (WiFi.status() != WL_CONNECTED &&
    //        millis() - startAttemptTime < WIFI_TIMEOUT_MS)
    // {
    // }

    // When we couldn't make a WiFi connection (or the timeout expired)
    // sleep for a while and then retry.
    // if (WiFi.status() != WL_CONNECTED)
    // {
    //   Serial.println("[WIFI] FAILED");
    //   vTaskDelay(WIFI_TIMEOUT_MS / portTICK_PERIOD_MS);
    //   continue;
    // }

    while (WiFi.status() == WL_CONNECTED)
    {
      unsigned long currentMillis1 = millis();
      if (currentMillis1 - previousMillis1 >= interval1)
      {
        Serial.println("Reconnecting to WiFi...");
        WiFi.disconnect();
        WiFi.reconnect();
        previousMillis1 = currentMillis1;
      }
      vTaskDelay(1000 / portTICK_PERIOD_MS); // Check for reconnection every second
    }

    Serial.println("[WIFI] Connected: " + WiFi.localIP());
  }
}

void taskEncoder(void *pvParameters)
{

  Serial.print("Task2 running on core ");
  Serial.println(xPortGetCoreID());
  for (;;)
  {
    int encoderValue = encoder.getCount();
    if (encoderValue > 0)
    {
      if (menu.isInEditMode())
      {
        charsetPosition = (charsetPosition + 1) % CHARSET_SIZE;
        menu.drawChar(charset[charsetPosition]);
        vTaskDelay(200 / portTICK_PERIOD_MS);
      }
      menu.down();
    }
    else if (encoderValue < 0)
    {
      if (menu.isInEditMode())
      {
        charsetPosition = constrain(charsetPosition - 1, 0, CHARSET_SIZE);
        menu.drawChar(charset[charsetPosition]);
        vTaskDelay(200 / portTICK_PERIOD_MS);
      }
      menu.up();
    }
    encoder.clearCount();
    vTaskDelay(10 / portTICK_PERIOD_MS);
  }
}

void taskButton(void *pvParameters)
{
  for (;;)
  {

    // if (WiFi.status() != WL_CONNECTED)
    // {

    //   unsigned long currentMillis1 = millis();
    //   // if WiFi is down, try reconnecting
    //   if ((WiFi.status() != WL_CONNECTED) && (currentMillis1 - previousMillis1 >= interval1))
    //   {
    //     Serial.print(millis());
    //     Serial.println("Reconnecting to WiFi...");
    //     WiFi.disconnect();
    //     WiFi.reconnect();
    //     previousMillis1 = currentMillis1;
    //   }

    //   Serial.print("Connected to");
    //   Serial.println(WIFI_SSID);

    //   DeviceStatus = false;

    //   delay(3000);
    // }

    button.tick();

    if (digitalRead(buttonMenuPin) == LOW)
    {
      Serial.println("Button Menu back Pressed");
      menu.back();
    }
    else if (digitalRead(buttonOkPin) == LOW)
    {
      Serial.println("Button OK Pressed");

      if (menu.isInEditMode())
      {
        menu.backspace();
        Serial.println("BackSpace");
        vTaskDelay(200 / portTICK_PERIOD_MS);
      }

      menu.show();
      sensorsData = false;
    }

    vTaskDelay(10 / portTICK_PERIOD_MS); // Reduce the delay
  }
}

void getSetPointsData()
{

  // TEMP
  // Retrieve initial values from Firebase
  if (Firebase.RTDB.get(&fbdo, listenerPath + "temp_set_point_off"))
    tempSetPointOff = fbdo.intData();
  if (Firebase.RTDB.get(&fbdo, listenerPath + "temp_set_point_on"))
    tempSetPointOn = fbdo.intData();

  // HUM
  if (Firebase.RTDB.get(&fbdo, listenerPath + "humd_set_point_off"))
    humdSetPointOff = fbdo.intData();
  if (Firebase.RTDB.get(&fbdo, listenerPath + "humd_set_point_on"))
    humdSetPointOn = fbdo.intData();

  // DEHUM
  if (Firebase.RTDB.get(&fbdo, listenerPath + "dehumd_set_point_off"))
    dehumdSetPointOff = fbdo.intData();
  if (Firebase.RTDB.get(&fbdo, listenerPath + "dehumd_set_point_on"))
    dehumdSetPointOn = fbdo.intData();

  // Store set point values in EEPROM
  EEPROM.put(EEPROM_TEMP_SET_POINT_ON_ADDR, tempSetPointOn);
  EEPROM.put(EEPROM_TEMP_SET_POINT_OFF_ADDR, tempSetPointOff);
  EEPROM.put(EEPROM_HUMD_SET_POINT_ON_ADDR, humdSetPointOn);
  EEPROM.put(EEPROM_HUMD_SET_POINT_OFF_ADDR, humdSetPointOff);
  EEPROM.put(EEPROM_DEHUMD_SET_POINT_ON_ADDR, dehumdSetPointOn);
  EEPROM.put(EEPROM_DEHUMD_SET_POINT_OFF_ADDR, dehumdSetPointOff);

  // Commit changes
  EEPROM.commit();
  Serial.println("Data Saved In EEPROM");

  // Read set point values from EEPROM and print them
  // float readTempSetPointOn;
  EEPROM.get(EEPROM_TEMP_SET_POINT_ON_ADDR, readTempSetPointOn);
  Serial.print("Read Temperature Set Point ON: ");
  Serial.println(readTempSetPointOn);

  // float readTempSetPointOff;
  EEPROM.get(EEPROM_TEMP_SET_POINT_OFF_ADDR, readTempSetPointOff);
  Serial.print("Read Temperature Set Point OFF: ");
  Serial.println(readTempSetPointOff);

  // float readHumdSetPointOn;
  EEPROM.get(EEPROM_HUMD_SET_POINT_ON_ADDR, readHumdSetPointOn);
  Serial.print("Read Humidity Set Point ON: ");
  Serial.println(readHumdSetPointOn);

  // float readHumdSetPointOff;
  EEPROM.get(EEPROM_HUMD_SET_POINT_OFF_ADDR, readHumdSetPointOff);
  Serial.print("Read Humidity Set Point OFF: ");
  Serial.println(readHumdSetPointOff);

