Saipreetham0/ESP32-stabakaiot/src/main.cpp
  // float readDehumdSetPointOn;
  EEPROM.get(EEPROM_DEHUMD_SET_POINT_ON_ADDR, readDehumdSetPointOn);
  Serial.print("Read Dehumidifier Set Point ON: ");
  Serial.println(readDehumdSetPointOn);

  // float readDehumdSetPointOff;
  EEPROM.get(EEPROM_DEHUMD_SET_POINT_OFF_ADDR, readDehumdSetPointOff);
  Serial.print("Read Dehumidifier Set Point OFF: ");
  Serial.println(readDehumdSetPointOff);
}

void lcdSetPointDataPrint()
{
  // Set numeric values for temperature menu
  sprintf(tempOnValue, "%d", tempSetPointOn);
  sprintf(tempOffValue, "%d", tempSetPointOff);
  tempMenu[1]->setValue(tempOnValue);
  tempMenu[2]->setValue(tempOffValue);

  // Set numeric values for dehumidifier menu
  sprintf(dehumOnValue, "%d", dehumdSetPointOn);
  sprintf(dehumOffValue, "%d", dehumdSetPointOff);
  dehumMenu[1]->setValue(dehumOnValue);
  dehumMenu[2]->setValue(dehumOffValue);

  // Set numeric values for humidity menu
  sprintf(humdOnValue, "%d", humdSetPointOn);
  sprintf(humdOffValue, "%d", humdSetPointOff);
  humMenu[1]->setValue(humdOnValue);
  humMenu[2]->setValue(humdOffValue);

  menu.update();
}

void useEEPROMSetPoints()
{
  // Read set point values from EEPROM
  EEPROM.get(EEPROM_TEMP_SET_POINT_ON_ADDR, readTempSetPointOn);
  EEPROM.get(EEPROM_TEMP_SET_POINT_OFF_ADDR, readTempSetPointOff);
  EEPROM.get(EEPROM_HUMD_SET_POINT_ON_ADDR, readHumdSetPointOn);
  EEPROM.get(EEPROM_HUMD_SET_POINT_OFF_ADDR, readHumdSetPointOff);
  EEPROM.get(EEPROM_DEHUMD_SET_POINT_ON_ADDR, readHumdSetPointOn);
  EEPROM.get(EEPROM_DEHUMD_SET_POINT_OFF_ADDR, readDehumdSetPointOff);

  Serial.println("Using set point values from EEPROM:");

  // Read set point values from EEPROM and print them

  Serial.print("Read Temperature Set Point ON: ");
  Serial.println(readTempSetPointOn);

  Serial.print("Read Temperature Set Point OFF: ");
  Serial.println(readTempSetPointOff);

  Serial.print("Read Humidity Set Point ON: ");
  Serial.println(readHumdSetPointOn);

  Serial.print("Read Humidity Set Point OFF: ");
  Serial.println(readHumdSetPointOff);

  Serial.print("Read Dehumidifier Set Point ON: ");
  Serial.println(readDehumdSetPointOn);

  Serial.print("Read Dehumidifier Set Point OFF: ");
  Serial.println(readDehumdSetPointOff);
}

void handleReadingError()
{
  // Handle error when reading temperature or humidity
  menu.lcd->clear();
  menu.lcd->setCursor(0, 0);
  menu.lcd->println("Error reading ");
  menu.lcd->setCursor(0, 1);
  menu.lcd->println("sensor data! Restarting...");

  ESP.restart();
}

void SetPointsRelayFunction()
{

  // SET POINTS OF TEMPERATURE
  if (!isnan(temperature))
  {
    Serial.print("Temperature: ");
    Serial.println(temperature);
    // displaySensorValues();

    if (temperature >= 1000)
    {
      ESP.restart();
    }

    if (temperature >= tempSetPointOn) // 24
    {
      delay(3000);
      digitalWrite(Relay1, LOW); // Turn on relay
      // Serial.println("Relay1 turned ON");
    }
    else if (temperature <= tempSetPointOff) // 22
    {
      delay(3000);
      digitalWrite(Relay1, HIGH); // Turn off relay
      // Serial.println("Relay1 turned OFF");
    }
  }
  else
  {
    handleReadingError();
  }

  //  Dehumidity  ---- heater
  // SET POINTS OF TEMPERATURE
  if (!isnan(humidity))
  {
    Serial.print("humidity: ");
    Serial.println(humidity);

    // displaySensorValues();

    // Dehumidification (Relay2)
    if (humidity >= dehumdSetPointOn) // 66 > 98
    {
      // delay(3000);
      digitalWrite(Relay2, LOW); // Turn on relay
      Serial.print("dehumdidity Set Point ON: ");
      Serial.println(dehumdSetPointOn);
      // Serial.println("Relay2 turned ON");
      // lcd.setCursor(0, 3);
      // lcd.print("R2 turned ON (DH)");
      // Add LCD update code if needed
    }
    else if (humidity <= dehumdSetPointOff) // 66 < 95
    {
      // delay(3000);
      digitalWrite(Relay2, HIGH); // Turn off relay
      Serial.print("dehumdidity Set Point OFF: ");
      Serial.println(dehumdSetPointOff);
      // Serial.println("Relay2 turned OFF");
      // lcd.setCursor(0, 3);
      // lcd.print("R2 turned oFF (DH)");
    }

    // humidity (Relay3)
    if (humidity < humdSetPointOn) // 24
    {

      // Serial.println(humidity + "<" + humdSetPointOff);
      delay(3000);
      digitalWrite(Relay3, LOW); // Turn on relay
      Serial.print("humdidity Set Point ON: ");
      Serial.println(humdSetPointOn);
      // Serial.println("Relay3 turned ON");
      // lcd.setCursor(0, 3);
      // lcd.print("Relay3 turned ON (H)");
      // Add LCD update code if needed
    }
    else if (humidity > humdSetPointOff)
    {
      delay(3000);

      // Serial.println(String(humidity) + ">" + humdSetPointOff);
      digitalWrite(Relay3, HIGH); // Turn off relay
      Serial.print("humdidity Set Point OFF: ");
      Serial.println(humdSetPointOff);
      // Serial.println("Relay3 turned OFF");
      // lcd.setCursor(0, 3);
      // lcd.print("Relay3 turned OFF (H)");
      // Add LCD update code if needed
    }
  }
  else
  {
    handleReadingError();
  }
}

void OfflineSetPointsRelayFunction()
{
  // SET POINTS OF TEMPERATURE
  if (!isnan(temperature))
  {
    Serial.print("Temperature: ");
    Serial.println(temperature);

    if (temperature >= 1000)
    {
      ESP.restart();
    }

    if (temperature >= readTempSetPointOn)
    {
      delay(3000);
      digitalWrite(Relay1, LOW); // Turn on relay
      Serial.println("Relay1 Off");
    }
    else if (temperature <= readTempSetPointOff)
    {
      delay(3000);
      digitalWrite(Relay1, HIGH); // Turn off relay
      Serial.println("Relay1 Off");
    }
  }
  else
  {
    handleReadingError();
  }

  // SET POINTS OF HUMIDITY
  if (!isnan(humidity))
  {
    Serial.print("Humidity: ");
    Serial.println(humidity);

    // Dehumidification (Relay2)
    if (humidity >= readDehumdSetPointOn)
    {
      digitalWrite(Relay2, LOW); // Turn on relay
      Serial.println("Relay2 On");
    }
    else if (humidity <= readDehumdSetPointOff)
    {
      digitalWrite(Relay2, HIGH); // Turn off relay
      Serial.println("Relay2 off");
    }

    // Humidity (Relay3)
    if (humidity < readHumdSetPointOn)
    {
      delay(3000);
      digitalWrite(Relay3, LOW); // Turn on relay
      Serial.println("Relay3 on");
    }
    else if (humidity > readHumdSetPointOff)
    {
      delay(3000);
      digitalWrite(Relay3, HIGH); // Turn off relay
      Serial.println("Relay3 off");
    }
  }
  else
  {
    handleReadingError();
  }
}

void CheckOtaUpdate()
{
  // if (Firebase.ready() && !taskCompleted)

