Saipreetham0/ESP32-stabakaiot/src/main.cpp
  if (WiFi.status() == WL_CONNECTED)
  {
    if (Firebase.ready())
    {
      // taskCompleted = true;

      // If you want to get download url to use with your own OTA update process using core update library,
      // see Metadata.ino example

      // Serial.println("\nChecking for new firmware update available...\n");
      menu.hide();

      // In ESP8266, this function will allocate 16k+ memory for internal SSL client.
      if (!Firebase.Storage.downloadOTA(
              &fbdo, STORAGE_BUCKET_ID /* Firebase Storage bucket id */,
              FIRMWARE_PATH /* path of firmware file stored in the bucket */,
              fcsDownloadCallback /* callback function */
              ))
      {
        Serial.println(fbdo.errorReason());
      }
      else
      {
        menu.hide();
        menu.lcd->clear();
        menu.lcd->setCursor(0, 0);
        menu.lcd->print("Restarting...");
        menu.lcd->setCursor(0, 1);
        menu.lcd->print("Device");
        delay(500);
        // Delete the file after update
        Serial.printf("Delete file... %s\n", Firebase.Storage.deleteFile(&fbdo, STORAGE_BUCKET_ID, FIRMWARE_PATH) ? "ok" : fbdo.errorReason().c_str());

        Serial.println("Restarting...\n\n");
        delay(2000);
        ESP.restart();
      }
    }
  }
  else
  {
    Serial.println("OTA Offline");
  }
}

void updateTime()
{
  if (!getLocalTime(&timeinfo))
  {
    Serial.println("Failed to obtain time");
    return;
  }
  strftime(timestamp, sizeof(timestamp), "%H:%M", &timeinfo);
}

void setup()
{
  Serial.begin(9600);
  Serial.println("Developed By KSP ELECTRONICS");
  Serial.println("Version:" + String(firmwareVersion));

  // LCD Menu
  menu.setupLcdWithMenu(0x27, mainMenu);
  menu.lcd->clear();
  menu.lcd->setCursor(0, 0);
  menu.lcd->print("Version:" + String(firmwareVersion));
  menu.lcd->setCursor(0, 1);
  menu.lcd->print("Getting Started");

  Wire.begin();
  mySerial.begin(9600);
  myMHZ19.begin(mySerial);
  myMHZ19.autoCalibration();
  EEPROM.begin(512); // Initialize EEPROM with a size of 512 bytes

  lightMeter.begin();

  bool status = bme.begin(0x76);
  if (!status)
  {
    Serial.println("Could not find a valid BME280 sensor, check wiring!");
  }

  delay(2000);
  initWiFi();
  menu.hide();
  menu.lcd->clear();
  menu.lcd->setCursor(0, 0);
  menu.lcd->print("initializing");
  menu.lcd->setCursor(0, 1);
  menu.lcd->print("Sensors");

  configTime(5.5 * 3600, 0, "pool.ntp.org"); // India has a UTC offset of 5 hours and 30 minutes

  // Initialize Outputs
  pinMode(Relay1, OUTPUT);
  pinMode(Relay2, OUTPUT);
  pinMode(Relay3, OUTPUT);
  pinMode(Relay4, OUTPUT);
  pinMode(Relay5, OUTPUT);
  pinMode(Relay6, OUTPUT);
  pinMode(Relay7, OUTPUT);
  pinMode(Relay8, OUTPUT);

  digitalWrite(Relay1, HIGH);
  digitalWrite(Relay2, HIGH);
  digitalWrite(Relay3, HIGH);
  digitalWrite(Relay4, HIGH);
  digitalWrite(Relay5, HIGH);
  digitalWrite(Relay6, HIGH);
  digitalWrite(Relay7, HIGH);
  digitalWrite(Relay8, HIGH);

  configF.api_key = API_KEY;
  auth.user.email = USER_EMAIL;
  auth.user.password = USER_PASSWORD;
  configF.token_status_callback = tokenStatusCallback;
  configF.max_token_generation_retry = 5;

  configF.database_url = DATABASE_URL;

  Firebase.begin(&configF, &auth);
  Firebase.reconnectWiFi(true);

  // ONE BUTTON
  button.attachClick(handleButtonClick);

  // Attach the encoder
  encoder.attachHalfQuad(ROTARY_ENCODER_CLK, ROTARY_ENCODER_DT);

  pinMode(buttonMenuPin, INPUT_PULLUP);
  pinMode(buttonOkPin, INPUT_PULLUP);

  charsetPosition = 0;

  // Firebase DataChanger Method
  if (!Firebase.RTDB.beginStream(&stream, listenerPath.c_str()))
    Serial.printf("stream begin error, %s\n\n", stream.errorReason().c_str());

  Firebase.RTDB.setStreamCallback(&stream, streamCallback, streamTimeoutCallback);

  // delay(2000);
  getSetPointsData();
  lcdSetPointDataPrint();
  // Sensors Getting Started

  if (!getLocalTime(&timeinfo))
  {
    Serial.println("Failed to obtain time");
    ESP.restart();
    return;
  }

  updateTime(); // Initial update of timestamp

  if (sensorsData)
  {

    displaySensorValues();
  }

  SensorDataUpload();

  // timer.setInterval(3000, uploadData);
  timer.setInterval(900000, SensorDataUpload);
  timer.setInterval(3000, CheckOtaUpdate);
  // timer.setInterval(60000, SensorDataUpload);
  // timer.setInterval(3000, getRealTimeSensorsData);

  xTaskCreatePinnedToCore(
      keepWiFiAlive, /* Task function. */
      "WiFiTask",    /* name of task. */
      10000,         /* Stack size of task */
      NULL,          /* parameter of the task */
      1,             /* priority of the task */
      NULL,          /* Task handle to keep track of created task */
      0);            /* pin task to core 0 */

  xTaskCreatePinnedToCore(
      taskEncoder,   /* Task function. */
      "TaskEncoder", /* name of task. */
      10000,         /* Stack size of task */
      NULL,          /* parameter of the task */
      1,             /* priority of the task */
      NULL,          /* Task handle to keep track of created task */
      0);            /* pin task to core 0 */

  xTaskCreatePinnedToCore(
      taskButton,   /* Task function. */
      "TaskButton", /* name of task. */
      10000,        /* Stack size of task */
      NULL,         /* parameter of the task */
      1,            /* priority of the task */
      NULL,         /* Task handle to keep track of created task */
      0);           /* pin task to core 0 */
}

void loop()
{

  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("WiFi connection lost. Attempting to connect to another network...");
    // wifiMulti
    if (WiFi.status() == WL_CONNECTED)
    {
      Serial.println("Connected to WiFi!");
      Serial.print("IP Address: ");
      Serial.println(WiFi.localIP());
    }
    else
    {
      Serial.println("Failed to connect to any WiFi network!");
    }
  }

  unsigned long currentMillis = millis(); // Get current time

  // Check if it's time to update the timestamp
  if (currentMillis - previousMillis >= interval)
  {
    // Save the last time the timestamp was updated
    previousMillis = currentMillis;

    // Update the timestamp
    updateTime();
  }

  // Check if WiFi is connected
  if (WiFi.status() == WL_CONNECTED)
  {
    DeviceStatus = false;
    // Your existing loop code for when WiFi is connected
    // This part will run when the device is connected to WiFi

    // Timer Run For Sensors Data Uploading
    timer.run();

    // Rest of your existing loop code...

