Saipreetham0/ESP32-stabakaiot/src/main.cpp
    if (Firebase.isTokenExpired())
    {
      Firebase.refreshToken(&configF);
      Serial.println("Refresh token");
    }

    if (dataChanged)
    {
      dataChanged = false;
      // When stream data is available, do anything here...
      getSetPointsData();
      lcdSetPointDataPrint();
    }

    if (sensorsData)
    {
      displaySensorValues();
    }

    // Get Sensors realtime Data
    getRealTimeSensorsData();

    SetPointsRelayFunction();

    // Your existing code for handling temperature, humidity, etc.
  }
  else
  {
    Serial.println("Offline Mode");
    DeviceStatus = true;
    useEEPROMSetPoints(); // Use EEPROM values instead
    getRealTimeSensorsData();
    OfflineSetPointsRelayFunction();

    if (sensorsData)
    {
      displaySensorValues();
    }

    digitalWrite(Relay4, HIGH);
    digitalWrite(Relay5, HIGH);
    digitalWrite(Relay6, HIGH);
    digitalWrite(Relay7, HIGH);
    digitalWrite(Relay8, HIGH);
  }

  Serial.print("loop() running on core ");
  Serial.println(xPortGetCoreID());

  // SetPointsRelayFunction();

  button.tick();
}

// LCD Menu

void inputCallback(char *value)
{
  // Serial.print(F("# "));
  Serial.println(value);
}

void updateSetPoint(const char *setPointType, const char *setPointName, char *value)
{
  // Check if the value is not null and not zero
  if (value != nullptr && atof(value) != 0)
  {
    if (Firebase.ready())
    {
      FirebaseJson json;
      parentPath = setPointType;
      json.set(setPointName, atof(value));

      // Uncomment the following line if you want to print the JSON data
      // Serial.printf("JSON Data: %s\n", json.toStdString().c_str());

      Serial.printf("Update node... %s\n", Firebase.RTDB.updateNode(&fbdo, listenerPath.c_str(), &json) ? "ok" : fbdo.errorReason().c_str());
      menu.lcd->clear();
      menu.lcd->setCursor(0, 0);
      menu.lcd->println("Saved Value");

      delay(5000);
      menu.show();
    }
    else
    {
      Serial.println("Firebase not ready. Node not updated.");
      menu.lcd->clear();

      menu.lcd->setCursor(0, 0);
      menu.lcd->println("Firebase not");
      menu.lcd->setCursor(0, 1);
      menu.lcd->println("ready. Node");
      menu.lcd->setCursor(0, 2);
      menu.lcd->println("not updated.");

      delay(5000);
      // menu.lcd->setCursor(0, 0);
      // menu.lcd->println("");
      menu.show();
    }
  }
  else
  {
    Serial.println("Value is null or zero. Node not updated.");
    menu.lcd->clear();
    menu.lcd->setCursor(0, 0);
    menu.lcd->println("Value is null or ");
    menu.lcd->setCursor(0, 1);
    menu.lcd->println("zero. Node not ");
    menu.lcd->setCursor(0, 2);
    menu.lcd->println("updated. ");

    delay(5000);
    menu.show();
  }

  lcdSetPointDataPrint();
}

void inputTempSetPointONCallback(char *value)
{
  updateSetPoint("temp_set_point_on", "temp_set_point_on", value);
}

void inputTempSetPointOFFCallback(char *value)
{
  updateSetPoint("temp_set_point_off", "temp_set_point_off", value);
}

void inputDehubSetPointONCallback(char *value)
{
  updateSetPoint("dehumd_set_point_on", "dehumd_set_point_on", value);
}

void inputDehubSetPointOFFCallback(char *value)
{
  updateSetPoint("dehumd_set_point_off", "dehumd_set_point_off", value);
}

void inputHumSetPointONCallback(char *value)
{
  updateSetPoint("humd_set_point_on", "humd_set_point_on", value);
}

void inputHumSetPointOFFCallback(char *value)
{
  // Check if the value is non-zero and not null

  updateSetPoint("humd_set_point_off", "humd_set_point_off", value);
}

// BackLight ON/OFF
void toggleBacklight(uint16_t isOn)
{
  menu.setBacklight(isOn);
}

// Menu HideMenu

void hideMenu()
{
  // Perform actions to hide the menu

  Serial.println("Menu Hide");
  menu.hide(); // Clear the LCD screen or perform other actions as needed
  // delay(100);
  sensorsData = true;
}
